[
  {
    "path": "posts/2021-09-01-blog1/",
    "title": "COVID-19 Vaccination in Nigeria",
    "description": "This post contains simple overview of the COVID-19 statistics in Nigeria and the vaccination statistics up till August, 2021.",
    "author": [
      {
        "name": "Tina Tsou",
        "url": {}
      }
    ],
    "date": "2021-09-01",
    "categories": [
      "Covid-19",
      "Nigeria",
      "Vaccination"
    ],
    "contents": "\n\nContents\nIntroduction\nData Description\nCOVID-19 Confirmed cases and Death\nVaccine Source and Vaccination Rate\n\n\n\n\n\nIntroduction\nAs we move towards the third quarter of 2021, many countries around the world have been accelerating their vaccination process. Unfortunately, the same cannot be said for other countries, especially those developing countries without the technology or resource to develop their own vaccines. Nigeria, being a country under the Humanitarian Response Plan (HRP), is one of the countries that requires external support. In this blog post, I will be looking into the coronavirus situation in Nigeria using data from Our World in Data.\nData Description\nTwo data sets are used in this short overview of COVID-19 situation in Nigeria, one on COVID-19 cases and one regarding the vaccination progress in Nigeria Hannah Ritchie and Roser (2020).\nCOVID-19 Confirmed cases and Death\nDue to the conditions in Nigeria, many of the more detailed variables such as icu patients, weekly_icu_admissions..etc. are missing from the data set. As COVID-19 related data is aggregated for countries all around the world, more developed countries with better recording resources will have more data. Nigeria, on the other hand, lacks record hence it has 45 less columns of data in comparison. For the purpose of my analysis, I cleaned up the data to remove the columns with completely no data, and used the remaining columns to illustrate the conditions of Nigeria.\n\n\n\nFollowing is the data description table for the cases data set:\n\n\n\nTable 1: Data Description table for COVID-19 Confirmed cases and Death\n\n\nVariables\n\n\nDescription\n\n\ndate\n\n\nDate of Record\n\n\ntotal_cases\n\n\nTotal confirmed cases of COVID-19\n\n\nnew_cases\n\n\nNew confirmed cases of COVID-19\n\n\nnew_cases_smoothed\n\n\nNew confirmed cases of COVID-19 (7-day smoothed)\n\n\ntotal_deaths\n\n\nTotal deaths attributed to COVID-19\n\n\nnew_deaths\n\n\nNew deaths attributed to COVID-19\n\n\nnew_deaths_smoothed\n\n\nNew deaths attributed to COVID-19 (7-day smoothed)\n\n\ntotal_cases_per_million\n\n\nTotal confirmed cases of COVID-19 per 1,000,000 people\n\n\nnew_cases_per_million\n\n\nNew confirmed cases of COVID-19 per 1,000,000 people\n\n\nnew_cases_smoothed_per_million\n\n\nNew confirmed cases of COVID-19 (7-day smoothed) per 1,000,000 people\n\n\ntotal_deaths_per_million\n\n\nReal-time estimate of the effective reproduction rate (R) of COVID-19\n\n\nnew_deaths_per_million\n\n\nDate of Record\n\n\nnew_deaths_smoothed_per_million\n\n\nTotal confirmed cases of COVID-19\n\n\nreproduction_rate\n\n\nNew confirmed cases of COVID-19\n\n\n\nVaccine Source and Vaccination Rate\nOur World in Data’s vaccination data is a compilation of vaccination data that are verifiable based on public official sources. The vaccination data is separated into two smaller data set, one containing the source of the vaccines and the other the vaccinated population count.\nVaccine Source\nThe following table contains the data descriptions for the vaccine source:\n\n\n\n\n\nTable 2: Data Description table for vaccine source\n\n\nVariables\n\n\nDescription\n\n\nPipeline\n\n\nThe vaccine pipeline through which the vaccine was delivered. Either COVAX or Other.\n\n\nVaccine\n\n\nThe common name of the vaccine delivered\n\n\nFunder\n\n\nThe name of the funder that funded the procurement of the vaccine. ‘Procured’ is used where a country purchased the vaccines using their own funds.\n\n\nDoses\n\n\nThe number of doses delivered\n\n\nSource.Url\n\n\nThe URL of the source article where information about the delivery was published\n\n\nNewPipeline\n\n\nCombination of pipeline and Funder\n\n\nDate\n\n\nThe date when the vaccine delivery was reported\n\n\nVaccine Administered\nThe following table contains the data descriptions for the vaccination progress:\n\n\n\n\n\n\nTable 3: Data Description table for the vaccination progress\n\n\nVariables\n\n\nDescription\n\n\ndate\n\n\nDate of the observation\n\n\ntotal_vaccinations\n\n\nTotal number of doses administered. For vaccines that require multiple doses, each individual dose is counted. If a person receives one dose of the vaccine, this metric goes up by 1. If they receive a second dose, it goes up by 1 again. If they receive a third/booster dose, it goes up by 1 again.\n\n\npeople_vaccinated\n\n\ntotal number of people who received at least one vaccine dose. If a person receives the first dose of a 2-dose vaccine, this metric goes up by 1. If they receive the second dose, the metric stays the same.\n\n\npeople_fully_vaccinated\n\n\nTotal number of people who received all doses prescribed by the vaccination protocol. If a person receives the first dose of a 2-dose vaccine, this metric stays the same. If they receive the second dose, the metric goes up by 1.\n\n\ndaily_vaccinations_raw\n\n\nDaily change in the total number of doses administered. It is only calculated for consecutive days.\n\n\ndaily_vaccinations\n\n\nNew doses administered per day (7-day smoothed). For countries that don’t report data on a daily basis, we assume that doses changed equally on a daily basis over any periods in which no data was reported. This produces a complete series of daily figures, which is then averaged over a rolling 7-day window.\n\n\ntotal_vaccinations_per_hundred\n\n\ntotal_vaccinations per 100 people in the total population of the country.\n\n\npeople_vaccinated_per_hundred\n\n\npeople_vaccinated per 100 people in the total population of the country.\n\n\npeople_fully_vaccinated_per_hundred\n\n\npeople_fully_vaccinated per 100 people in the total population of the country.\n\n\ndaily_vaccinations_per_million\n\n\ndaily_vaccinations per 1,000,000 people in the total population of the country.\n\n\n\n\n\n\nHannah Ritchie, Lucas Rodés-Guirao, Edouard Mathieu, and Max Roser. 2020. “Coronavirus Pandemic (COVID-19).” Our World in Data.\n\n\n\n\n",
    "preview": "posts/2021-09-01-blog1/../../images/fusion-medical-animation-rnr8D3FNUNY-unsplash.jpg",
    "last_modified": "2021-09-03T18:25:37+08:00",
    "input_file": "blog1.knit.md"
  }
]
